sisext-sapi-services/src/main/resources/soap/schemas/templates/soap-sendTextMessage-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://webapps.online.ericsson.com">
   <soapenv:Header/>
   <soapenv:Body>
      <web:sendmessageRequestElement>
         <web:sender>#[p('sendMessage.properties.sender')]</web:sender>
         <web:recipient>#[payload.textMessage.phoneNumber]</web:recipient>
         <web:textmessage>#[payload.textMessage.message]</web:textmessage>
         <web:mode>#[p('sendMessage.properties.mode')]</web:mode>
      </web:sendmessageRequestElement>
   </soapenv:Body>
</soapenv:Envelope>